'''
1. Користувач вводить із клавіатури номер дня тижня (1-7). Необхідно вивести на екран назви дня тижня. Наприклад, якщо 1, на екрані напис понеділок, 2 — вівторок тощо.
'''

days_of_week = {
    1: "Понеділок",
    2: "Вівторок",
    3: "Середа",
    4: "Четвер",
    5: "П'ятниця",
    6: "Субота",
    7: "Неділя",
}

while True:

    try:
        day_number = int(input("Введіть номер дня тижня (1-7): "))
    except ValueError:
        print("Номером дня тижня можу бути тільки число(ціле). Будь ласка введіть номер дня тижня від 1 до 7")
        continue

    if 1 <= day_number <= 7:
        print("День тижня:", days_of_week[day_number])
        break
    else:
        print("Номер дня тижня повинен бути від 1 до 7")